# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Christopher Kuzma\Downloads\Cypress Thing\EnvironmentSensing.cydsn\EnvironmentSensing.cydsn\EnvironmentSensing.cyprj
# Date: Thu, 02 Feb 2017 00:16:24 GMT
#set_units -time ns
create_clock -name {Clock_1(FFB)} -period 62.5 -waveform {0 31.25} [list [get_pins {ClockBlock/ff_div_4}]]
create_clock -name {CSD_ModClk(FFB)} -period 5312.5 -waveform {0 2656.25} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {Clock_2(FFB)} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/ff_div_13}]]
create_clock -name {Clock_3(FFB)} -period 500 -waveform {0 250} [list [get_pins {ClockBlock/ff_div_12}] [get_pins {ClockBlock/ff_div_14}]]
create_clock -name {EzI2C_SCBCLK(FFB)} -period 729.16666666666663 -waveform {0 364.583333333333} [list [get_pins {ClockBlock/ff_div_0}]]
create_clock -name {Clk_1kHz(FFB)} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ff_div_5}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 7} [list]
create_generated_clock -name {CSD_ModClk} -source [get_pins {ClockBlock/hfclk}] -edges {1 255 511} [list]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/hfclk}] -edges {1 7 13} [list]
create_generated_clock -name {Clock_3} -source [get_pins {ClockBlock/hfclk}] -edges {1 25 49} [list]
create_generated_clock -name {EzI2C_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 35 71} [list]
create_generated_clock -name {Clk_1kHz} -source [get_pins {ClockBlock/hfclk}] -edges {1 48001 96001} [list]


# Component constraints for C:\Users\Christopher Kuzma\Downloads\Cypress Thing\EnvironmentSensing.cydsn\EnvironmentSensing.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Christopher Kuzma\Downloads\Cypress Thing\EnvironmentSensing.cydsn\EnvironmentSensing.cydsn\EnvironmentSensing.cyprj
# Date: Thu, 02 Feb 2017 00:16:22 GMT
